Revit 2026 API

# View3DIsSectionBoxActive Property

---

Identifies whether or not the section box is active in this 3D view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSectionBoxActive { get; set; }
```
```vb
Public Property IsSectionBoxActive As Boolean
	Get
	Set
```
```cpp
public:
property bool IsSectionBoxActive {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsSectionBoxActive : bool with get, set
```

#### Property Value

Boolean An active section box clips the geometry of the model in the 3D view. This affects the appearance of the view, and also will affect information returned from the API. For example:

  * Elements outside the active section box will not be returned in the list of elements obtained from [!:Autodesk::Revit::DB::FilteredElementCollector] when this view is passed when contructing the collector.
  * Elements clipped by the active section box will return clipped geometry from GeometryOptions when this view is included in the options.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Returns true if the view is not a view template. |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace